; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_2 ?v3 - type_1 ?v2 - type_3)
 	      (pred_3 ?v7 - object ?v2 - type_3)
	      (pred_1 ?v3 - type_1 ?v8 - type_2)
	      (pred_4 ?v3 - type_1 ?v7 - object ?v8 - type_2))

   (:action op_3
       :parameters  (?v3 - type_1 ?v5 ?v1 - type_3)
       :precondition (and  (pred_2 ?v3 ?v5))
       :effect (and  (pred_2 ?v3 ?v1)
		     (not (pred_2 ?v3 ?v5))))

   (:action op_2
       :parameters (?v3 - type_1 ?v6 - object ?v4 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_3 ?v6 ?v4) (pred_2 ?v3 ?v4) (pred_1 ?v3 ?v8))
       :effect (and (pred_4 ?v3 ?v6 ?v8)
		    (not (pred_3 ?v6 ?v4)) 
		    (not (pred_1 ?v3 ?v8))))

   (:action op_1
       :parameters (?v3 - type_1 ?v6 - object ?v4 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_4 ?v3 ?v6 ?v8) (pred_2 ?v3 ?v4))
       :effect (and (pred_3 ?v6 ?v4)
		    (pred_1 ?v3 ?v8)
		    (not (pred_4 ?v3 ?v6 ?v8)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_01 - type_1
obj_08 obj_09 - type_2
obj_10 obj_02 obj_07 obj_06 - type_3
obj_03 obj_04 obj_05 - object)
(:init
(pred_2 obj_01 obj_10)
(pred_1 obj_01 obj_08)
(pred_1 obj_01 obj_09)
(pred_3 obj_03 obj_10)
(pred_3 obj_04 obj_06)
(pred_3 obj_05 obj_07)
)
(:goal
(and
(pred_3 obj_03 obj_10)
(pred_3 obj_04 obj_02)
(pred_3 obj_05 obj_02)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_01 ?b obj_08))))
)
)

; plan
1. (op_3 obj_01 obj_10 obj_06)
   deleted: (pred_2 obj_01 obj_10)
   added: (pred_2 obj_01 obj_06)
   goals met: 1 of 3
2. (op_2 obj_01 obj_04 obj_06 obj_09)
   deleted: (pred_3 obj_04 obj_06) (pred_1 obj_01 obj_09)
   added: (pred_4 obj_01 obj_04 obj_09)
   goals met: 1 of 3
3. (op_3 obj_01 obj_06 obj_07)
   deleted: (pred_2 obj_01 obj_06)
   added: (pred_2 obj_01 obj_07)
   goals met: 1 of 3
4. (op_3 obj_01 obj_07 obj_02)
   deleted: (pred_2 obj_01 obj_07)
   added: (pred_2 obj_01 obj_02)
   goals met: 1 of 3
5. (op_1 obj_01 obj_04 obj_02 obj_09)
   deleted: (pred_4 obj_01 obj_04 obj_09)
   added: (pred_3 obj_04 obj_02) (pred_1 obj_01 obj_09)
   goals met: 2 of 3
6. (op_3 obj_01 obj_02 obj_07)
   deleted: (pred_2 obj_01 obj_02)
   added: (pred_2 obj_01 obj_07)
   goals met: 2 of 3
7. (op_2 obj_01 obj_05 obj_07 obj_09)
   deleted: (pred_3 obj_05 obj_07) (pred_1 obj_01 obj_09)
   added: (pred_4 obj_01 obj_05 obj_09)
   goals met: 2 of 3
8. (op_3 obj_01 obj_07 obj_02)
   deleted: (pred_2 obj_01 obj_07)
   added: (pred_2 obj_01 obj_02)
   goals met: 2 of 3
9. (op_1 obj_01 obj_05 obj_02 obj_09)
   deleted: (pred_4 obj_01 obj_05 obj_09)
   added: (pred_3 obj_05 obj_02) (pred_1 obj_01 obj_09)
   goals met: 3 of 3
